//------------------------------------------------------------------------------
// circle.cpp - содержит функции обработки круга
//------------------------------------------------------------------------------

#include "circle.h"
#include "constants.h"
#include "rnd.h"

//------------------------------------------------------------------------------
// Ввод параметров круга из потока
void circle::In(std::ifstream &ifst) {
    ifst >> this->x >> this->y >> this->r;
}

// Случайный ввод параметров круга
shape * circle::InRnd() {
    this->x = Random();
    this->y = Random();
    this->r = Random();

    return this;
}

//------------------------------------------------------------------------------
// Вывод параметров круга в поток
void circle::Out(std::ofstream &ofst) {
    ofst << "It is Circle: with center in x = "
         << this->x << ", y = "
         << this->y << ", radius = "
         << this->r << "). Square = "
         << this->Square() << "\n";
}

//------------------------------------------------------------------------------
// Вычисление площади круга
double circle::Square() {
    return Pi * this->r * this->r;
}
