#ifndef __triangle__
#define __triangle__

//------------------------------------------------------------------------------
// triangle.h - содержит описание треугольника
//------------------------------------------------------------------------------

#include <fstream>
# include "rnd.h"
#include "shape.h"

//------------------------------------------------------------------------------
// треугольник
class triangle : public shape {
public:
    int x1, y1, x2, y2, x3, y3; // Координаты трёх углов

// Ввод параметров треугольника из файла
    virtual void In(std::ifstream &ifst);

// Случайный ввод параметров треугольника
    virtual shape * InRnd();

// Вывод параметров треугольника в форматируемый поток
    virtual void Out(std::ofstream &ofst);

// Вычисление площади треугольника
    virtual double Square();
};

#endif //__triangle__
